Revit 2027 API
BuiltInFailures.EditingFailures.ExtendToOtherWarn Property
 Can't keep [Type Name] extended to [Type Name].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ExtendToOtherWarn { get; }
Public Shared ReadOnly Property ExtendToOtherWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ExtendToOtherWarn {
	FailureDefinitionId^ get ();
}
static member ExtendToOtherWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace